package docs

import "github.com/axogc/backend/utils"

var PrivacyPolicy = utils.Doc{
	Slug:       "privacy-policy",
	Title:      "隐私政策",
	DocGroupID: 1,
	UserID:     1,
	Content: `

1. 我们绝不会向第三方出售或租赁您的个人信息。此隐私政策旨在告诉您我们如何收集、使用、存储和披露您的信息。

### 收集的信息类型

1. 对于游戏服务器，我们会记录你的大多数行为（包括但不限于在线情况、玩家坐标、放置物品、游戏聊天等），以在必要时解决玩家纠纷。

2. 对于Axolotland的网站：
   - 当你注册账号时，可能需要提供电子邮件地址。
   - 我们会记录你的活动（例如访问的页面、点击的链接）。
   - 我们会使用cookie来改善用户体验。

### 如何使用这些信息

1. 对于游戏服务器：
   - 我们公开所有人的游戏内行为的目的在于为玩家之间的纠纷提供证据支持。例如基岩版服务器，其他玩家可在[be.mcax.cn](https://be.mcax.cn)查看你的行为记录。
   - 我们会收集玩家在线情况和赞助记录并进行数据可视化展示。
   - 我们会实时收集玩家坐标并绘制一份公开地图，这意味着其他玩家可以实时看到你在服务器里的位置。
   - 我们可能在没有提前告知的情况下将你在服务器的作品作为优秀作品在海报或宣传视频里展示或存入[回忆录](https://img.mcax.cn)。

2. 对于网站：
   - 我们使用cookie储存你上一次的登录数据以改善用户体验。
   - 你的活动（例如访问的页面、点击的链接）将用于提供、维护和改进我们的服务。
		`,
}
